clc;
clear;
data=convertTDMS(0,'12-24/2.tdms');%读取TDMS文件
y1=data.Data.MeasuredData(4).Data;%获取TDMS文件中的第四列数据

fs=16000;%采样频率
T=1/fs;%采样时间
L=length(y1(:,1));%信号长度
t=(0:L-1)*T;% 时间

%*****************************时域波形*****************************
figure(1);
plot(t,y1);%时域波形图
xlabel('时间/s');ylabel('幅值');
title('振动信号时域波形图');

%*****************************频域域波形*****************************
N=2^nextpow2(L); %采样点数,采样点数越大,分辨的频率越精确,N>>=L
Y=fft(y1,N)/N*2; %除以N乘以2才是真实幅值,N越大,幅值精度越高
f=fs/N*(0:1:N-1); %频率
A=abs(Y); %幅值
figure(2);
plot(f(1:N/2),A(1:N/2));%函数fft返回值的数据结构具有对称性,因此我们只取前一半
title('幅值频谱')
xlabel('频率(Hz)')
ylabel('幅值')


